---
kind: other
id: Methods.T:Autodesk.Revit.DB.InternalDefinition
source: html/17a383ab-f9ba-92d1-8c55-6de1dd248fdd.htm
---
# InternalDefinition Methods

Gets a ForgeTypeId identifying the data type describing values of the parameter.